{
  "bot": {
    "start": "<b>cobalt.tools</b> — это новейший и, вероятно, самый быстрый способ загружать видео, фотографии и многое другое из интернета.\n\nЯ не являюсь официальным дополнением к их сайту; это создано энтузиастом, чтобы вы больше не открывали сайт снова и снова. Этот бот также поможет вам делиться мемами, видео и другими «важными» вещами с друзьями!\n\nНачать использовать этого бота очень легко: просто отправь свои ссылки в чат, и он быстро ответит с видео <b>БЕЗ</b> каких-либо проблем, таких как платные подписки, требования регистрации и другие ненужные вещи.\n\n<a href='https://t.me/shckpst'><i>кошачье существо, что создало меня</i></a> / <a href='https://t.me/shobolt'><i>новости и обновления</i></a>",

    "settings": {
      "accept_only_messages": "Скачивать из сообщений",
      "accept_only_commands": "Скачивать из команд",
      "default_quality": "Изменить качество скачиваний"
    },

    "errors": {
      "permissions": {
        "insufficient": "У вас недостаточно прав для использования данной команды, обратитесь к администратору этой группы."
      }
    }
  },

  "messages": {
    "settings": {
      "quality_options": "Поддерживаемые качество видео, которые будут применены при скачивании: `1080`, `720` and `480`",
      "quality_invalid": "{quality} не поддерживается, попробуйте: `1080`, `720` and `480`",
      "updated_settings": "Успешно!"
    }
  },

  "error": {
    "api": {
      "link": {
        "unsupported": "Упс, похоже ссылка предоставленная вами не является действительной, если вы уверены что она рабочая, сообщите об этом в поддержку.",
        "invalid": "Упс, ссылка неверна или сервис ещё не поддерживается. Проверь, что вставил правильную ссылку."
      },
      "fetch": {
        "critical": "Упс, произошла неизвестная ошибка. Попробуй ещё раз через несколько секунд. Если проблема сохраняется, сообщи нам, и мы разберёмся!",
        "fail": "Упс, что-то пошло не так при получении информации. Убедись, что ссылка работает. Если она действительно работает, а ошибка сохраняется, сообщи нам, и мы постараемся помочь!",
        "empty": "Не удалось найти медиа для загрузки. Убедись, что ссылка верна, и попробуйте снова!"
      },
      "youtube": {
        "api_error": "Упс, произошла ошибка при получении информации о видео. Проверьте, что ссылка верна, и попробуйте снова!",
        "youtube.login": "Упс, похоже Ютуб в данный момент недоступен в боте, попробуйте позже.\n\nМы сообщим когда эта ошибка будет исправлена в <a href='https://t.me/shobolt'>нашем канале</a>"
      },
      "content": {
        "post": {
          "age": "Упс, контент который вы пытаетесь скачать - ограничен по возрасту!"
        }
      },

      "invalid_body": "Упс, ответ от сервера неверный. Пожалуйста, попробуйте позже!"
    },

    "telegram": {
      "send": {
        "mixed": "Упс, вы пытаетесь скачать несколько ссылок одновременно, и некоторые из них имеют несовместимый формат для отправки в одном сообщении. Обычно, это происходит из-за аудио и видео в одном сообщении, попробуйте разбить их на отдельные сообщения."
      }
    }
  }
}
